#pragma once
//=====================================================================//
/*!	@file
	@brief	MAX6675 クラス @n
			Cold-Junction-Compensated @n
			K-Thermocouple to Digital Converter 0 C to 1024 C
			Copyright 2017 Kunihito Hiramatsu
	@author	平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//
#include <cmath>

namespace chip {

	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	/*!
		@brief  MAX6675 テンプレートクラス
		@param[in]	SPI	spi クラス
		@param[in]	CS	チップ・セレクト
	*/
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	template <class SPI, class CS>
	class MAX6675 {

		SPI&	spi_;

	public:
		//-----------------------------------------------------------------//
		/*!
			@brief	コンストラクタ
		 */
		//-----------------------------------------------------------------//
		MAX6675(SPI& spi) : spi_(spi) { }


		//-----------------------------------------------------------------//
		/*!
			@brief	開始
		 */
		//-----------------------------------------------------------------//
		void start()
		{
			CS::DIR = 1;
			CS::P = 1;
		}


		//-----------------------------------------------------------------//
		/*!
			@brief	() オペレーター
			@return 変換温度 (0 to 4095) 0.25 C
		 */
		//-----------------------------------------------------------------//
		uint16_t operator () ()
		{
			CS::P = 0;
			uint8_t tmp[2];
			spi_.read(tmp, 2);
			uint16_t v = (static_cast<uint16_t>(tmp[0]) << 6) | (static_cast<uint16_t>(tmp[1]) >> 2);
			CS::P = 1;
			return v;
		}
	};
}
