#pragma once
//=====================================================================//
/*! @file
    @brief  R8C 起動前初期化 @n
			Copyright 2015 Kunihito Hiramatsu
    @author 平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//

#ifdef __cplusplus
extern "C" {
#endif
	//-----------------------------------------------------------------//
	/*!
		@brief  メイン関数起動前初期化
	*/
	//-----------------------------------------------------------------//
	void _init(void);
#ifdef __cplusplus
};
#endif
